Switching element type to Curtain Family. All Split Face Regions in the element will be deleted.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId LooseFaceSplitsForCurtainWall { get; }
  Visual Basic
Public Shared ReadOnly Property LooseFaceSplitsForCurtainWall As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ LooseFaceSplitsForCurtainWall {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures LooseDimensionFailures Class
  Autodesk.Revit.DB Namespace